Projects/url_shortener/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url_id", 4], ["created_at", "2022-03-21 21:04:45.055026"], ["updated_at", "2022-03-21 21:04:45.055026"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)